[{"title": "NASA's Perseverance Rover Bringing 3D-Printed Metal Parts to Mars", "preview": "For hobbyists and makers, 3D printing expands creative possibilities; for specialized engineers, it's also key to next-generation spacecraft design."}, {"title": "Scientists Explore Outback as Testbed for Mars ", "preview": "Australia provides a great place for NASA's Mars 2020 and the ESA-Roscosmos ExoMars scientists to hone techniques in preparation for searching for signs ancient life on Mars."}, {"title": "NASA Perseverance Mars Rover Scientists Train in the Nevada Desert", "preview": "Team members searched for signs of ancient microscopic life there, just as NASA's latest rover will on the Red Planet next year."}, {"title": "Mars Is Getting a New Robotic Meteorologist", "preview": "Sensors on NASA's Perseverance will help prepare for future human exploration by taking weather measurements and studying dust particles."}, {"title": "How NASA's Perseverance Mars Team Adjusted to Work in the Time of Coronavirus ", "preview": "Like much of the rest of the world, the Mars rover team is pushing forward with its mission-critical work while putting the health and safety of their colleagues and community first."}, {"title": "Curiosity Mars Rover's Summer Road Trip Has Begun", "preview": "After more than a year in the \"clay-bearing unit,\" Curiosity is making a mile-long journey around some deep sand so that it can explore higher up Mount Sharp."}, {"title": "Virginia Middle School Student Earns Honor of Naming NASA's Next Mars Rover", "preview": "NASA chose a seventh-grader from Virginia as winner of the agency's \"Name the Rover\" essay contest. Alexander Mather's entry for \"Perseverance\" was voted tops among 28,000 entries. "}, {"title": "With Mars Methane Mystery Unsolved, Curiosity Serves Scientists a New One: Oxygen", "preview": "For the first time in the history of space exploration, scientists have measured the seasonal changes in the gases that fill the air directly above the surface of Gale Crater on Mars. "}, {"title": "Deadline Closing for Names to Fly on NASA's Next Mars Rover", "preview": "You have until Sept. 30 to send your names to Mars aboard the Mars 2020 rover. "}, {"title": "NASA's Mars 2020 Heads Into the Test Chamber", "preview": "In this time-lapse video taken at JPL, engineers move the Mars 2020 rover into a large vacuum chamber for testing in Mars-like environmental conditions."}, {"title": "The Detective Aboard NASA's Perseverance Rover", "preview": "An instrument called SHERLOC will, with the help of its partner WATSON, hunt for signs of ancient life by detecting organic molecules and minerals."}, {"title": "NASA's Mars 2020 Will Hunt for Microscopic Fossils", "preview": "A new paper identifies a ring of minerals at the rover's landing site that are ideal for fossilizing microbial life."}, {"title": "NASA's Push to Save the Mars InSight Lander's Heat Probe", "preview": "The scoop on the end of the spacecraft's robotic arm will be used to 'pin' the mole against the wall of its hole."}, {"title": "NASA Moves Forward With Campaign to Return Mars Samples to Earth", "preview": "During this next phase, the program will mature critical technologies and make critical design decisions as well as assess industry partnerships."}, {"title": "6 Things to Know About NASA's Ingenuity Mars Helicopter", "preview": "The first helicopter attempting to fly on another planet is a marvel of engineering. Get up to speed with these key facts about its plans."}]